<?php

namespace Database\Seeders;

use App\Models\Branch;
use Illuminate\Database\Seeder;

class branchSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $branches = [
            // رئاسة البلدية
            ['name' => 'رئيس البلدية', 'section_id' => 1], // مكتب رئيس البلدية
            
            ['name' => 'رئيس السكرتاريا', 'section_id' => 2], // قسم السكرتاريا والخدمات
            
            ['name' => 'أمين المجلس', 'section_id' => 3], // قسم لجان المجلس البلدي
            
            // وحدة الرقابة الداخلية
            ['name' => 'قسم الرقابة الفنية', 'section_id' => 4], // وحدة الرقابة الداخلية
            ['name' => 'شعبة رقابة التنظيم والتخطيط', 'section_id' => 4], // قسم الرقابة الفنية
            ['name' => 'شعبة رقابة المشاريع', 'section_id' => 4], // قسم الرقابة الفنية
            ['name' => 'قسم الرقابة الإدارية والمالية', 'section_id' => 4], // وحدة الرقابة الداخلية
            ['name' => 'شعبة الرقابة الإدارية', 'section_id' => 4], // قسم الرقابة الإدارية والمالية
            ['name' => 'شعبة الرقابة المالية', 'section_id' => 4], // قسم الرقابة الإدارية والمالية
            
            // الوحدة القانونية
            ['name' => 'قسم محكمة البلدية', 'section_id' => 5], // الوحدة القانونية
            ['name' => 'شعبة قلم المحكمة', 'section_id' => 5], // قسم محكمة البلدية
            ['name' => 'شعبة أرشيف المحكمة', 'section_id' => 5], // قسم محكمة البلدية
            ['name' => 'قسم الإيجارات والأملاك', 'section_id' => 5], // الوحدة القانونية
            ['name' => 'شعبة إيجارات البلدية', 'section_id' => 5], // قسم الإيجارات والأملاك
            ['name' => 'شعبة أملاك البلدية', 'section_id' => 5], // قسم الإيجارات والأملاك
            ['name' => 'قسم القضايا والعقود', 'section_id' => 5], // الوحدة القانونية
            ['name' => 'شعبة العقود والتصديقات', 'section_id' => 5], // قسم القضايا والعقود
            ['name' => 'شعبة القضايا', 'section_id' => 5], // قسم القضايا والعقود
            
            // وحدة العلاقات العامة والتعاون الدولي
            ['name' => 'قسم العلاقات العامة والإعلام', 'section_id' => 6], // وحدة العلاقات العامة والتعاون الدولي
            ['name' => 'قسم التعاون الدولي', 'section_id' => 6], // وحدة العلاقات العامة والتعاون الدولي
            ['name' => 'قسم المرأة والطفل', 'section_id' => 6], // وحدة العلاقات العامة والتعاون الدولي
            
            // وحدة الحاسوب وتكنولوجيا المعلومات
            ['name' => 'قسم البرمجة', 'section_id' => 7], // وحدة الحاسوب وتكنولوجيا المعلومات
            ['name' => 'شعبة البرمجة', 'section_id' => 7], // قسم البرمجة
            ['name' => 'شعبة قواعد البيانات', 'section_id' => 7], // قسم البرمجة
            ['name' => 'قسم الشبكات', 'section_id' => 7], // وحدة الحاسوب وتكنولوجيا المعلومات
            
            // مدير البلدية
            ['name' => 'مدير البلدية', 'section_id' => 10], // سكرتير مدير البلدية
            ['name' => 'سكرتير مدير البلدية', 'section_id' => 10], // سكرتير مدير البلدية
            
            ['name' => 'رئيس السكرتاريا', 'section_id' => 11], // قسم السكرتاريا العامة
            ['name' => 'شعبة الأرشيف', 'section_id' => 11], // قسم السكرتاريا العامة
            ['name' => 'شعبة السكرتاريا', 'section_id' => 11], // قسم السكرتاريا العامة
            
            ['name' => 'رئيس التفتيش', 'section_id' => 12], // قسم التفتيش والمتابعة
            ['name' => 'شعبة التفتيش', 'section_id' => 12], // قسم التفتيش والمتابعة
            ['name' => 'شعبة المتابعة', 'section_id' => 12], // قسم التفتيش والمتابعة
            
            // دائرة المشاريع
            ['name' => 'شعبة الوثائق والعطاءات', 'section_id' => 13], // قسم إعداد وتصميم المشاريع
            ['name' => 'شعبة الدراسات وتجنيد الأموال', 'section_id' => 13], // قسم إعداد وتصميم المشاريع
            ['name' => 'شعبة الإشراف', 'section_id' => 14], // قسم التنفيذ والإشراف
            ['name' => 'شعبة متابعة المستخلصات', 'section_id' => 14], // قسم التنفيذ والإشراف
            ['name' => 'شعبة الطرق', 'section_id' => 15], // قسم الأشغال العامة
            ['name' => 'شعبة المباني والمنشآت', 'section_id' => 15], // قسم الأشغال العامة
            ['name' => 'شعبة انارة الطرق', 'section_id' => 16], // قسم الكهرباء والإنارة
            ['name' => 'شعبة الصيانة', 'section_id' => 16], // قسم الكهرباء والإنارة
            
            // دائرة التنظيم والتخطيط
            ['name' => 'شعبة الترخيص', 'section_id' => 17], // قسم الأبنية والتنظيم
            ['name' => 'شعبة الأرشيف', 'section_id' => 17], // قسم الأبنية والتنظيم
            ['name' => 'شعبة مراقبي الأبنية والتفتيش', 'section_id' => 17], // قسم الأبنية والتنظيم
            ['name' => 'شعبة المساحة', 'section_id' => 18], // قسم المساحة
            ['name' => 'شعبة الرسم الموقع العام', 'section_id' => 18], // قسم المساحة
            ['name' => 'شعبة تراخيص الحرف', 'section_id' => 19], // قسم الحرف والصناعات
            ['name' => 'شعبة اليافطات والإعلانات', 'section_id' => 19], // قسم الحرف والصناعات
            ['name' => 'شعبة التخطيط', 'section_id' => 20], // قسم التخطيط والتطوير
            ['name' => 'شعبة الرسم', 'section_id' => 20], // قسم التخطيط والتطوير
            ['name' => 'شعبة الـ GIS', 'section_id' => 21], // قسم البيانات والـ GIS
            ['name' => 'شعبة إدخال البيانات والأرشفة', 'section_id' => 21], // قسم البيانات والـ GIS
            ['name' => 'شعبة الإحصاء والمتابعة الميدانية', 'section_id' => 21], // قسم البيانات والـ GIS
            
            // دائرة المياه والصرف الصحي
            ['name' => 'شعبة التوزيع', 'section_id' => 22], // قسم المياه
            ['name' => 'شعبة الآبار', 'section_id' => 22], // قسم المياه
            ['name' => 'شعبة الشبكات', 'section_id' => 22], // قسم المياه
            ['name' => 'شعبة التفتيش والمتابعة', 'section_id' => 22], // قسم المياه
            ['name' => 'شعبة التسليك والتعزيل', 'section_id' => 23], // قسم الصرف الصحي
            ['name' => 'شعبة الصيانة والشبكات', 'section_id' => 23], // قسم الصرف الصحي
            ['name' => 'شعبة صيانة الكهرباء', 'section_id' => 24], // قسم التشغيل والصيانة
            ['name' => 'شعبة صيانة الميكانيك', 'section_id' => 24], // قسم التشغيل والصيانة
            ['name' => 'شعبة الأحواض', 'section_id' => 24], // قسم التشغيل والصيانة
            ['name' => 'شعبة التشغيل', 'section_id' => 24], // قسم التشغيل والصيانة
            
            // دائرة الصحة والبيئة
            ['name' => 'شعبة النظافة العامة', 'section_id' => 25], // قسم النفايات الصلبة
            ['name' => 'شعبة سيارات النظافة', 'section_id' => 25], // قسم النفايات الصلبة
            ['name' => 'شعبة الحدائق والمتنزهات', 'section_id' => 26], // قسم البيئة والبستنة
            ['name' => 'شعبة مكافحة الحشرات والحيوانات الضارة', 'section_id' => 26], // قسم البيئة والبستنة
            ['name' => 'شعبة المسلخ', 'section_id' => 27], // قسم الرقابة الصحية
            ['name' => 'شعبة الأغذية', 'section_id' => 27], // قسم الرقابة الصحية
            ['name' => 'شعبة الصحة والبيئة', 'section_id' => 27], // قسم الرقابة الصحية
            ['name' => 'شعبة الإرشاد', 'section_id' => 27], // قسم الرقابة الصحية
            ['name' => 'شعبة صيانة الآليات', 'section_id' => 29], // قسم الورش والآليات
            
            // دائرة الشؤون المالية
            ['name' => 'شعبة قراء العدادات', 'section_id' => 30], // قسم الجباية العامة
            ['name' => 'شعبة الإدخال', 'section_id' => 30], // قسم الجباية العامة
            ['name' => 'شعبة تدقيق البيانات', 'section_id' => 30], // قسم الجباية العامة
            ['name' => 'شعبة التحصيل والسداد الآلي', 'section_id' => 30], // قسم الجباية العامة
            ['name' => 'شعبة الموازنة', 'section_id' => 31], // قسم المحاسبة
            ['name' => 'شعبة الرواتب', 'section_id' => 31], // قسم المحاسبة
            ['name' => 'شعبة التقارير المالية', 'section_id' => 31], // قسم المحاسبة
            ['name' => 'شعبة تدقيق الإيرادات', 'section_id' => 32], // قسم التدقيق المالي
            ['name' => 'شعبة تدقيق المصروفات', 'section_id' => 32], // قسم التدقيق المالي
            ['name' => 'شعبة المشتريات', 'section_id' => 33], // قسم اللوازم والمشتريات
            ['name' => 'شعبة اللوازم والتوريدات', 'section_id' => 33], // قسم اللوازم والمشتريات
            ['name' => 'شعبة الصندوق', 'section_id' => 34], // قسم الصندوق العام
            ['name' => 'شعبة التوريدات النقدية', 'section_id' => 34], // قسم الصندوق العام
            
            // دائرة الشؤون الإدارية والموارد البشرية
            ['name' => 'شعبة الموارد البشرية', 'section_id' => 35], // قسم الموارد البشرية
            ['name' => 'شعبة معاملات الموظفين', 'section_id' => 35], // قسم الموارد البشرية
            ['name' => 'شعبة المخازن', 'section_id' => 36], // قسم المستودعات
            ['name' => 'شعبة حفظ الوثائق', 'section_id' => 37], // قسم الأرشيف المركزي
            ['name' => 'شعبة الأرشفة الإلكترونية', 'section_id' => 37], // قسم الأرشيف المركزي
            ['name' => 'شعبة الاستلام والتسليم', 'section_id' => 37], // قسم الأرشيف المركزي
            ['name' => 'شعبة خدمات البلدية', 'section_id' => 38], // قسم خدمات البلدية
            ['name' => 'شعبة السائقين', 'section_id' => 38], // قسم خدمات البلدية
            ['name' => 'قسم الحراسة', 'section_id' => 38], // قسم خدمات البلدية
            
            // وحدة قلم الجمهور
            ['name' => 'شعبة الشكاوي', 'section_id' => 39], // قسم قلم الجمهور
            ['name' => 'شعبة الاشتراكات', 'section_id' => 39], // قسم قلم الجمهور
            ['name' => 'شعبة التراخيص', 'section_id' => 39], // قسم قلم الجمهور
            ['name' => 'شعبة كبار المشتركين', 'section_id' => 40], // قسم خدمات المشتركين
            ['name' => 'شعبة المديونيات القديمة', 'section_id' => 40], // قسم خدمات المشتركين
        ];

        foreach ($branches as $branch) {
            Branch::create($branch);
        }
    }
}